javascript.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>JavaScript</title>
<meta name="author" content="(neymarsabin)"/>
<link rel="stylesheet" href="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/css/theme/night.css" id="theme"/>

<link rel="stylesheet" href="./modified.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-orgf922e36" data-background="./images/javascript.gif" data-background-size="1400px" data-background-transition="defult">
<h2 id="orgf922e36"></h2>



</section>
</section>
<section>
<section id="slide-org2498ba5">
<h2 id="org2498ba5">JavaScript</h2>
<p>
JavaScript is a cross-platform,object-oriented programming language.It is a small and lightweight language. <br />
</p>
<blockquote nil>
<p>
Client Side || Server Side 
</p>
</blockquote>
<blockquote nil>
<p>
Javascript is all about making content of web document dynamic.
</p>
</blockquote>

</section>
</section>
<section>
<section id="slide-org1366170">
<h2 id="org1366170">JavaScript can do&#x2026;</h2>
<ul>
<li>Provides HTML designers a programming Tool</li>
<li>Can put dynamic test into HTML/ read and write in html documents</li>
<li>Can react to events</li>
<li>can be used to validate data</li>
<li>&#x2026;&#x2026;.</li>

</ul>


</section>
</section>
<section>
<section id="slide-org46ed0b2">
<h2 id="org46ed0b2">Popular Javascript Frameworks</h2>
<ul>
<li>Angular*JS</li>
<li>ReactJS</li>
<li>NodeJS</li>
<li>VueJS</li>
<li>EmberJS</li>
<li>MeteorJS</li>

</ul>


</section>
</section>
<section>
<section id="slide-org66e69a2">
<h2 id="org66e69a2">Data Types in Javascript</h2>
<ul>
<li>Boolean</li>
<li>Null</li>
<li>Undefined</li>
<li>Number</li>
<li>String</li>
<li>Objects</li>

</ul>

</section>
</section>
<section>
<section id="slide-orge354a1e">
<h2 id="orge354a1e">Basics of JavaScript</h2>
<ul>
<li>Everything is case sensitive</li>
<li><p>
variables are loosely typed <br />
</p>
<div class="org-src-container">

<pre  class="src src-js"><span style="color: #75715E;">// </span><span style="color: #75715E;">integer </span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">a</span> = 10;
<span style="color: #75715E;">// </span><span style="color: #75715E;">string </span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">favoriteColor</span> = <span style="color: #E6DB74;">"red"</span>;
<span style="color: #75715E;">// </span><span style="color: #75715E;">boolean </span>
<span style="color: #F92672;">var</span> <span style="color: #FD971F;">canDriveCar</span> = <span style="color: #AE81FF;">false</span>;
</pre>
</div></li>
<li><b>var</b> keyword is used</li>
<li>variables need not have to be declared before using</li>

</ul>

</section>
</section>
<section>
<section id="slide-org22719fe">
<h2 id="org22719fe">Document Object Model (DOM)</h2>
<ul>
<li>application programming interface(API) for valid HTML documents.It defines the logical structure of documents and the way a document is accessed and manipulated.</li>

</ul>


</section>
</section>
<section>
<section id="slide-org53fa572">
<h2 id="org53fa572">DOM&#x2026;</h2>
<ul>
<li>A web page is a document</li>
<li>DOM provides the way to represent,store and manipulate the document(web page).</li>
<li>Object Oriented representation of web page</li>
<li>DOM is not a programming language</li>

</ul>

</section>
</section>
<section>
<section id="slide-orgfca59d6" data-background="./images/domtree.gif" data-background-size="1000px" data-background-transition="linear">
<h2 id="orgfca59d6"></h2>

</section>
</section>
<section>
<section id="slide-org74582a8">
<h2 id="org74582a8">Some DOM methods</h2>
<ul>
<li>document.getElementById("id")</li>
<li>document.getElementsByTagName(name)</li>
<li>document.getElementsByClassName(name)</li>
<li>document.createElement(name)</li>
<li>parentNode.appendChild(node)</li>
<li>element.innerHTML</li>
<li>element.style.*</li>
<li>element.setAttribute(attribute,value)</li>
<li>element.getAttribute</li>
<li>element.addEventListener</li>
<li>document.appendChild(element)</li>
<li>document.replaceChild(element)</li>
<li>document.write(text)</li>

</ul>
</section>
</section>
</div>
</div>
<script src="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/lib/js/head.min.js"></script>
<script src="file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'file:///mnt/hackit/codeds/github-repos/reveal.js/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
